import cv2

'''__________________________________________________________________讀取圖片'''
img = cv2.imread('./pic1.jpg') 

'''______________________________________顯示圖片 > 任意鍵下一步 > 關閉所有視窗'''
cv2.imshow('image_shape', img)
cv2.waitKey(0)
cv2.destroyAllWindows()

print("圖像的形狀（高度、寬度、通道數） :" , img.shape)      # (375, 500, 3)
print("圖像中的像素總數 :" , img.size)                     # 562500
print("圖像的數據類型（每個像素的數據類型） :" , img.dtype)  # uint8
print("圖像的像素值 :\n" , img)   

#%%

import cv2

'''__________________________________________________________________讀取圖片'''
img = cv2.imread('./pic2.jpg')

'''_____________________________________________將圖像拆分為藍色、綠色和紅色通道'''
b , g , r = cv2.split(img)

print("***************************************印出藍色通道\n" , b , "\n")
print("***************************************印出綠色通道\n" , g , "\n") 
print("***************************************印出紅色通道\n" , r , "\n") 

'''______________________________________顯示圖片 > 任意鍵下一步 > 關閉所有視窗'''
cv2.imshow('bgr-cut', img)
cv2.waitKey(0)
cv2.destroyAllWindows()
