import cv2

'''__________________________________________________________________讀取圖片'''
img = cv2.imread("lena256rgb.jpg")

'''_______________________________________________________________顯示原始圖片'''
cv2.imshow('Resize-org', img) 
cv2.waitKey(0)

'''________________________________________________透過切片取得圖片中的臉部區域'''
face = img[95 : 195 , 100 : 180]
cv2.imshow("Face" , face)
cv2.waitKey(0)
 
'''________________________________________________透過切片取得圖片中的身體區域'''
body = img[20 : , 35 : 210]
cv2.imshow("Body" , body)
cv2.waitKey(0)

'''______________________________________________________________關閉所有視窗'''    
cv2.destroyAllWindows() 
